# IFC_ClearIFCInfo

## Description
Removes all IFC data

```pascal
FUNCTION IFC_ClearIFCInfo(hObject : HANDLE) : BOOLEAN;
```

```python

def vs.IFC_ClearIFCInfo(hObject):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE||

## Version
Availability: from Vectorworks 2014
## Category
* IFC